// Lab_3_1.cpp
// Козубенко Андрій
// Лабораторна робота № 3.1
// Розгалуження, задане формулою: функція однієї змінної.
// Варіант 10

#include <iostream>
#include <cmath>

using std::cout;
using std::cin;
using std::endl;

int main() 
{
	double x; // вхідний параметр
	double y; // результат обчислення виразу
	double A; // проміжний результат - функціонально стала частина виразу
	double B; // проміжний результат - функціонально змінна частина виразу

	cout << "x = "; cin >> x;

	A = 4.95 * x * x;

	// 1 спосіб: розгалуження в скороченій формі
	if (x < -3.5)
		B = 4.0 + 1.0 / x * x;
	if (x >= -3.5 && x < 1.0)
		B = tan((3.5 + x) / 5.0);
	if (x >= 1.0)
		B = sin(3.0 * x) - cos(x);

	y = A + B;

	cout << endl << "1) y = " << y << endl;

	// 2 спосіб: розгалуження в повній формі
	if (x < -3.5)
		B = 4.0 + 1.0 / x * x;
	else
		if (x >= 1.0)
			B = sin(3.0 * x) - cos(x);
		else 
			B = tan((3.5 + x) / 5.0);

	y = A + B;

	cout << "2) y = " << y << endl;
	
	cin.get();
	return 0;
}